## Part 1: Explore the Data

Import the data and use Pandas to learn more about the dataset.

In [153]:
import pandas as pd
import os
import datetime as dt

##### CSV file directory

In [154]:
os.getcwd()

'C:\\Users\\Chris\\Desktop\\Columbia\\Week_4\\Week_4_challenge'

In [155]:
path = 'C:\\Users\\Chris\\Desktop\\Columbia\\Week_4\\Week_4_challenge\\Resources\\client_dataset.csv'

#### Data Import

In [156]:
origin_df = pd.read_csv(path)

#### Copying dataframe

In [157]:
df = origin_df.copy()

### Exploring Data

In [158]:
df.head()

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,item_id,category,subcategory,unit_price,unit_cost,unit_weight,qty,line_number
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,EUD29711-63-6U,decor,wall art,1096.80,762.71,7.50,105,1
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,XDA18116-89-4A,consumables,pens,24.95,15.09,1.49,21,0
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,ABE59463-05-7E,software,project management,13.52,7.86,1.68,39,6
3,Nathan,Baker,Accounting technician,827-788-8123x012,bakernathan@benson.com,46554,9031802,2023-04-25,17,2023,ZMM00836-65-0C,consumables,pens,36.42,24.85,1.23,29,3
4,Christina,Schwartz,Chiropractor,265-829-3643,christinaschwartz9252@mcconnell.com,92089,1322274,2023-05-28,21,2023,BZX55559-12-3X,consumables,misc,195.10,108.17,46.43,20,1

### Column names

In [159]:
df.columns

Index(['first', 'last', 'job', 'phone', 'email', 'client_id', 'order_id',
       'order_date', 'order_week', 'order_year', 'item_id', 'category',
       'subcategory', 'unit_price', 'unit_cost', 'unit_weight', 'qty',
       'line_number'],
      dtype='object')

### Using the describe method()

In [160]:
df.describe()

,client_id,order_id,order_week,order_year,unit_price,unit_cost,unit_weight,qty,line_number
count,54639.000000,5.463900e+04,54639.000000,54639.000000,54639.000000,54639.000000,54639.000000,5.463900e+04,54639.000000
mean,54837.869416,5.470190e+06,11.359139,2022.993064,136.267207,99.446073,5.004116,5.702646e+02,2.979667
std,25487.438231,2.599807e+06,7.023499,0.082997,183.873135,133.164267,5.326599,1.879552e+04,2.436320
min,10033.000000,1.000886e+06,1.000000,2022.000000,0.010000,0.010000,0.000000,0.000000e+00,0.000000
25%,33593.000000,3.196372e+06,6.000000,2023.000000,20.800000,14.840000,1.450000,3.200000e+01,1.000000
50%,53305.000000,5.496966e+06,11.000000,2023.000000,68.310000,49.890000,3.240000,6.800000e+01,3.000000
75%,78498.000000,7.733869e+06,17.000000,2023.000000,173.160000,125.570000,6.890000,1.700000e+02,5.000000
max,99984.000000,9.998480e+06,52.000000,2023.000000,1396.230000,846.270000,46.430000,3.958244e+06,9.000000

### Feature information

In [161]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54639 entries, 0 to 54638
Data columns (total 18 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   first        54639 non-null  object
 1   last         54639 non-null  object
 2   job          54639 non-null  object
 3   phone        54639 non-null  object
 4   email        54639 non-null  object
 5   client_id    54639 non-null  int64
 6   order_id     54639 non-null  int64
 7   order_date   54639 non-null  object
 8   order_week   54639 non-null  int64
 9   order_year   54639 non-null  int64
 10  item_id      54639 non-null  object
 11  category     54639 non-null  object
 12  subcategory  54639 non-null  object
 13  unit_price   54639 non-null  float64
 14  unit_cost    54639 non-null  float64
 15  unit_weight  54639 non-null  float64
 16  qty          54639 non-null  int64
 17  line_number  54639 non-null  int64
dtypes: float64(3), int64(6), object(9)
memory usage: 7.5+ MB

#### Re-casting features

In [162]:
df['subcategory'] = df['subcategory'].astype('category')
df['category'] = df['category'].astype('category')
df['order_date'] = pd.to_datetime(df['order_date'])
df['item_id'] = df['item_id'].astype('category')
df['client_id'] = df['client_id'].astype('category')
df['order_id'] = df['order_id'].astype('category')
df['line_number'] = df['line_number'].astype('category')

#### What three item categories had the most entries?

In [163]:
df['category'].value_counts()[:3]

category
consumables    23538
furniture      11915
software        8400
Name: count, dtype: int64

#### For the category with the most entries, which subcategory had the most entries?

In [164]:
df[['category','subcategory']].value_counts(ascending=False)[:1]

category     subcategory
consumables  bathroom supplies    6424
Name: count, dtype: int64

#### Which five clients had the most entries in the data?

In [165]:
df['client_id'].value_counts()[:5]

client_id
33615    220
66037    211
46820    209
38378    207
24741    207
Name: count, dtype: int64

#### Store the client ids of those top 5 clients in a list.

In [166]:
df['client_id'].value_counts()[:5].index.to_list()

[33615, 66037, 46820, 38378, 24741]

#### How many total units (the qty column) did the client with the most entries order order?

In [167]:
df.loc[df['client_id']== 33615]['qty'].sum()

64313

## Part 2: Transform the Data
Do we know that this client spent the more money than client 66037? If not, how would we find out? Transform the data using the steps below to prepare it for analysis.

#### Create a column that calculates the subtotal for each line using the unit_price  and the qty

In [168]:
df['line_subtotal'] = df.apply(lambda row:row['unit_price']*row['qty'],axis=1)
df[['unit_price','qty','line_subtotal']].head(2)

   unit_price  qty  line_subtotal
0     1096.80  105      115164.00
1       24.95   21         523.95

#### Create a column for shipping price.
**Assume a shipping price of 7 per pound for orders over 50 lbs, and 10 per pound for items 50 pounds or under**

In [169]:
over_50 = 7
under_50 = 10
df['total_weight'] = df['unit_weight']*df['qty']
df['shipping_price'] = df.apply(lambda row:row['total_weight']*over_50 if row['total_weight'] > 50 else row['total_weight']*under_50,axis=1)

In [170]:
df[['unit_price',
    'unit_weight',
    'qty',
    'total_weight',
    'shipping_price']].head(3)

   unit_price  unit_weight  qty  total_weight  shipping_price
0     1096.80         7.50  105        787.50         5512.50
1       24.95         1.49   21         31.29          312.90
2       13.52         1.68   39         65.52          458.64

#### Create a column for total price
**Using the subtotal and the shipping price along with a sales tax of 9.25%**

In [171]:
sales_tax = 0.0925
df['line_price'] = (df['line_subtotal'] + df['shipping_price'])*(1+sales_tax)
df['line_price'] = df['line_price'].round(2)

In [172]:
df[['line_subtotal',
    'shipping_price',
    'line_price']].head(3)

   line_subtotal  shipping_price  line_price
0      115164.00         5512.50   131839.08
1         523.95          312.90      914.26
2         527.28          458.64     1077.12

#### Create a column for the cost of each line
**Use unit_cost, qty, shipping_price**

In [173]:
df['line_cost'] = (df['unit_cost']*df['qty']) + df['shipping_price']
df['line_cost'] = df['line_cost'].round(2)

In [174]:
df[['unit_cost',
    'qty',
    'shipping_price',
    'line_cost']].head(3)

   unit_cost  qty  shipping_price  line_cost
0     762.71  105         5512.50   85597.05
1      15.09   21          312.90     629.79
2       7.86   39          458.64     765.18

In [175]:
df.head(3)

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,...,unit_price,unit_cost,unit_weight,qty,line_number,line_subtotal,total_weight,shipping_price,line_price,line_cost
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,...,1096.80,762.71,7.50,105,1,115164.00,787.50,5512.50,131839.08,85597.05
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,...,24.95,15.09,1.49,21,0,523.95,31.29,312.90,914.26,629.79
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,...,13.52,7.86,1.68,39,6,527.28,65.52,458.64,1077.12,765.18

#### Create a column for the profit of each line
**Use line_cost and line_price**

In [176]:
df['line_profit'] = df['line_price'] - df['line_cost']

In [177]:
df['line_profit'].round(2)
df[['line_price',
    'line_cost',
    'line_profit']].head(3)

   line_price  line_cost  line_profit
0   131839.08   85597.05     46242.03
1      914.26     629.79       284.47
2     1077.12     765.18       311.94

In [178]:
df.head(3)

,first,last,job,phone,email,client_id,order_id,order_date,order_week,order_year,...,unit_cost,unit_weight,qty,line_number,line_subtotal,total_weight,shipping_price,line_price,line_cost,line_profit
0,Donald,Harding,Immunologist,793-904-7725x39308,harding.donald.7185@sullivan.com,58515,8953482,2023-04-28,17,2023,...,762.71,7.50,105,1,115164.00,787.50,5512.50,131839.08,85597.05,46242.03
1,Tiffany,Myers,Music therapist,201.442.4543x942,myers.t.6537@ferguson-johnson.net,37609,8069089,2023-05-19,20,2023,...,15.09,1.49,21,0,523.95,31.29,312.90,914.26,629.79,284.47
2,Shannon,Watson,Immunologist,687.737.9424x8503,swatson8146@payne.net,57113,1902144,2023-01-29,4,2023,...,7.86,1.68,39,6,527.28,65.52,458.64,1077.12,765.18,311.94

## Part 3: Confirm your work
You have email receipts showing that the total prices for 3 orders. Confirm that your calculations match the receipts. Remember, each order has multiple lines.

Order ID 2742071 had a total price of \$152,811.89

Order ID 2173913 had a total price of \$162,388.71

Order ID 6128929 had a total price of \$923,441.25

In [179]:
order_list = [2742071,2173913,6128929]
for order in order_list:
    order_total = df.loc[df['order_id'] == order]['line_price'].sum().round(2)
    print(f'Order {order} total: ${order_total}')

Order 2742071 total: $152811.89
Order 2173913 total: $162388.71
Order 6128929 total: $923441.25

## Part 4: Summarize and Analyze
Use the new columns with confirmed values to find the following information.

#### How much did each of the top 5 clients by quantity spend?

In [180]:
client_list = df['client_id'].value_counts()[:5].index.to_list()
for client in client_list:
    client_total = df.loc[df['client_id'] == client]['line_price'].sum().round(2)
    print(f'client number {client} total: ${client_total}')

client number 33615 total: $8377308.52
client number 66037 total: $10259514.79
client number 46820 total: $9743794.36
client number 38378 total: $12906550.87
client number 24741 total: $82268892.02

#### Create a summary DataFrame showing the totals for the top 5 clients with the following information:
**1) Total units purchased<br>
2) Total shipping price<br>
3) Total revenue<br>
4) Total profit<br>
5) Sort by total profit**

In [181]:
client_list = [33615, 66037, 46820, 38378, 24741]

client_df = pd.pivot_table(df,values = ['qty','shipping_price','line_price','line_cost','line_profit'],index = 'client_id',aggfunc='sum')
client_df = client_df[client_df.index.isin(client_list)]
client_df.reset_index(inplace=True)

client_df = client_df[['client_id','qty','shipping_price','line_price','line_cost','line_profit']]
client_df.sort_values(by='line_profit',ascending=False)

  client_id     qty  shipping_price   line_price    line_cost  line_profit
0     24741  239862      5126448.37  82268892.02  45688899.71  36579992.31
2     38378   73667      3429455.40  12906550.87   9634720.98   3271829.89
4     66037   43018      1395151.85  10259514.79   7004482.98   3255031.81
3     46820   75768      1601448.84   9743794.36   7007191.64   2736602.72
1     33615   64313      1828984.89   8377308.52   6175313.91   2201994.61

#### Format the data and rename the columns to names suitable for presentation.
**Currency should be in millions of dollars**

##### Renaming and sorting columns

In [182]:
rename_dict = {'client_id':'Client ID',
               'qty':'Units',
               'shipping_price':'Shipping',
               'line_price':'Total Revenue',
               'line_cost':'Total Cost',
               'line_profit':'Total Profit'}

client_df.rename(columns = rename_dict, inplace=True)

client_df.sort_values(by='Total Profit',inplace = True,ascending=False)

##### Converting to millions

In [183]:
def millions(amount):
    m = 1000000
    return f'{round(amount/m,2)}M'

client_df['Shipping'] = client_df['Shipping'].apply(millions)
client_df['Total Revenue'] = client_df['Total Revenue'].apply(millions)
client_df['Total Cost'] = client_df['Total Cost'].apply(millions)
client_df['Total Profit'] = client_df['Total Profit'].apply(millions)

In [184]:
client_df

  Client ID   Units Shipping Total Revenue Total Cost Total Profit
0     24741  239862    5.13M        82.27M     45.69M       36.58M
2     38378   73667    3.43M        12.91M      9.63M        3.27M
4     66037   43018     1.4M        10.26M       7.0M        3.26M
3     46820   75768     1.6M         9.74M      7.01M        2.74M
1     33615   64313    1.83M         8.38M      6.18M         2.2M

#### From Part-2
**Do we know that this client spent the more money than client 66037?**<b>
<b>From the rankings we can see the client 66307 is ranked #3 in total expenditures